In [1]:
#Q1. List any five functions of the pandas library with execution.

In [ ]:
#Answer - head(), describe(),columns(),goupby(),merge()

In [5]:

# Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
 # DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [66]:
import pandas as pd

In [68]:
df =pd.DataFrame({"A":[10,20,30],
      "B":[20,25,30],
      "C":[30,35,40]
})

In [70]:
type(df)

pandas.core.frame.DataFrame

In [72]:
df

    A   B   C
0  10  20  30
1  20  25  35
2  30  30  40

In [112]:
def reindex(df):
    new_index = range(1, 1+2*len(df),2)
    df.index = new_index
    return df

In [114]:
reindexed = reindex(df)
print(reindexed)

    A   B   C
1  10  20  30
3  20  25  35
5  30  30  40

In [116]:
#Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
#iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
#function should print the sum to the console.

In [120]:
df1 =pd.DataFrame([10, 20, 30, 40, 50])

In [122]:
df1

    0
0  10
1  20
2  30
3  40
4  50

In [130]:
df1.iloc[:3].sum()

0    60
dtype: int64

In [ ]:
#Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
#'Word_Count' that contains the number of words in each row of the 'Text' column.

In [189]:
df2 = pd.DataFrame(["Ram kumar yadav","Shyam singh","Ruhi sharma kumari","Sita kumari yadav gupta","Jack sparrow","Sid"])

In [207]:
df2.rename(columns={0:'Word'},inplace= True)

In [209]:
df2['Word count']= df2['Word'].apply(lambda x: len(str(x).split()))

In [211]:
df2

                      Word  Word count
0          Ram kumar yadav           3
1              Shyam singh           2
2       Ruhi sharma kumari           3
3  Sita kumari yadav gupta           4
4             Jack sparrow           2
5                      Sid           1

In [213]:
#Q5. How are DataFrame.size() and DataFrame.shape() different?

In [ ]:
#DataFrame.size
#Definition: The .size attribute returns the total number of elements in the DataFrame.
#What it counts: It counts every individual element (cell) in the DataFrame, so it is the product of the number of rows and columns.
#Type: It is an integer.
#DataFrame.shape
#Definition: The .shape attribute returns a tuple representing the dimensions (rows, columns) of the DataFrame.
#What it counts: It provides the number of rows and columns in the DataFrame.
#Type: It is a tuple of two integers: (number of rows, number of columns).

In [ ]:
#Q6. Which function of pandas do we use to read an excel file?
# Answer - read_xlsx()

In [ ]:
#Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
#addresses in the format 'username@domain.com'. Write a Python function that creates a new column
#'Username' in df that contains only the username part of each email address.
#The username is the part of the email address that appears before the '@' symbol. For example, if the
#email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
#function should extract the username from each email address and store it in the new 'Username'
#column.

In [215]:
df3 = pd.DataFrame({
    'Email': ['john.doe@example.com', 'jane_smith@test.com', 'user123@domain.org','sid@iift.com']
})

In [217]:
df3

                  Email
0  john.doe@example.com
1   jane_smith@test.com
2    user123@domain.org
3          sid@iift.com

In [229]:
df3['Username'] = df3['Email'].str.split('@').str[0]

In [231]:
df3

                  Email    Username
0  john.doe@example.com    john.doe
1   jane_smith@test.com  jane_smith
2    user123@domain.org     user123
3          sid@iift.com         sid

In [233]:
df3['Extension']=df3['Email'].str.split('@').str[1]

In [235]:
df3

                  Email    Username    Extension
0  john.doe@example.com    john.doe  example.com
1   jane_smith@test.com  jane_smith     test.com
2    user123@domain.org     user123   domain.org
3          sid@iift.com         sid     iift.com

In [ ]:
#Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
#all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
#function should return a new DataFrame that contains only the selected rows.
#For example, if df contains the following values:

In [239]:
df4 = pd.DataFrame({"A":[3,8,6,2,9],
      "B":[5,2,9,3,1],
      "C":[1,7,4,5,1]
})

In [241]:
df4

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  1

In [247]:
df4[(df4['A']>5) & (df4['B']<df4['A'])]

   A  B  C
1  8  2  7
4  9  1  1

In [ ]:
#Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
# median, and standard deviation of the values in the 'Values' column.

In [249]:
df4.describe()

             A         B         C
count  5.00000  5.000000  5.000000
mean   5.60000  4.000000  3.600000
std    3.04959  3.162278  2.607681
min    2.00000  1.000000  1.000000
25%    3.00000  2.000000  1.000000
50%    6.00000  3.000000  4.000000
75%    8.00000  5.000000  5.000000
max    9.00000  9.000000  7.000000

In [ ]:
#Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
#create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
#for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
#should include the current day.

In [255]:
df5 = pd.DataFrame({'Day': range(10)})

#####

In [272]:
from datetime import date
datetime = date.today()
print(datetime)

2024-11-29

In [297]:
df5 = pd.DataFrame({'Date': pd.date_range(start = datetime.today(), periods=10),
                   'Sales':[1000,2000,3000,4000,5000,6000,70000,8000,9000,10000]})

In [303]:
df5['Moving Average']=df5['Sales'].rolling(window=3).apply(lambda x: x.mean())

#####

In [305]:
df5

        Date  Sales  Moving Average
0 2024-11-29   1000             NaN
1 2024-11-30   2000             NaN
2 2024-12-01   3000          2000.0
3 2024-12-02   4000          3000.0
4 2024-12-03   5000          4000.0
5 2024-12-04   6000          5000.0
6 2024-12-05  70000         27000.0
7 2024-12-06   8000         28000.0
8 2024-12-07   9000         29000.0
9 2024-12-08  10000          9000.0

In [ ]:
#Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
#column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
#Monday, Tuesday) corresponding to each date in the 'Date' column.
#For example, if df contains the following values:

In [351]:
df6 = pd.DataFrame({'DATE':['2023-01-01', '2023-01-02','2023-01-03','2023-01-04','2023-01-05'],
                  'Weekdays': ['Monday','Tuesday','Wednesday','Thrusday','Friday']})

######

In [337]:
from datetime import datetime

In [353]:
df6

         DATE   Weekdays
0  2023-01-01     Monday
1  2023-01-02    Tuesday
2  2023-01-03  Wednesday
3  2023-01-04   Thrusday
4  2023-01-05     Friday

In [ ]:
#Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
#be imported?

In [356]:
import pandas as pd